Revit 2027 API
BuiltInFailures.FamilyFailures.CustomFittingCreated Property
 Custom fitting was created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CustomFittingCreated { get; }
Public Shared ReadOnly Property CustomFittingCreated As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CustomFittingCreated {
	FailureDefinitionId^ get ();
}
static member CustomFittingCreated : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace